In [1]:
import pandas as pd

In [8]:
data={"name":['a','b','c','d','a','c'],
      "eng":[2,3,4,2,2,3],
      "marathi":[4,2,4,5,4,6]}

In [10]:
df=pd.DataFrame(data)

In [12]:
df

  name  eng  marathi
0    a    2        4
1    b    3        2
2    c    4        4
3    d    2        5
4    a    2        4
5    c    3        6

In [22]:
# to see value is duplicate or not 
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [26]:
df.duplicated().sum()

1

In [34]:
# remove duplicate
df.drop_duplicates(inplace=True)

In [36]:
df

  name  eng  marathi
0    a    2        4
1    b    3        2
2    c    4        4
3    d    2        5
5    c    3        6

In [38]:
# duplicate removed

In [40]:
# taking dataset from file

In [42]:
import pandas as pd

In [46]:
dataframe=pd.read_csv("loan.csv");

In [48]:
dataframe

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [50]:
dataframe.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
609    False
610    False
611    False
612    False
613    False
Length: 614, dtype: bool

In [60]:
dataframe.duplicated().sum()
dataframe.shape

(614, 13)

In [58]:
dataframe.drop_duplicates(inplace=True)

In [62]:
dataframe.shape

(614, 13)

In [64]:
# there is no duplicate value is present in dataset